src/cf/Documents/bm_КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>bm_КорректировкаРегистров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Регистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/bm_КорректировкаРегистров/Forms/СоставРегистров/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.ИзменятьСоставСтрок = Ложь;
	Элементы.Список.ИзменятьПорядокСтрок = Ложь;
	Элементы.СписокИмя.ТолькоПросмотр = Истина;
	Элементы.СписокСиноним.ТолькоПросмотр = Истина;
	
	ДокументОбъект = Документы.bm_КорректировкаРегистров.СоздатьДокумент();
	
	Документы.bm_КорректировкаРегистров.ЗаполнитьСписокРегистров(ЭтотОбъект.Список, ДокументОбъект.Движения, Ложь);
	
	Для Каждого Отбор Из Параметры.МассивРегистров Цикл
		МассивСтрок = ЭтотОбъект.Список.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() > 0 Тогда
			ИскомаяСтрока = МассивСтрок[0];
			ИскомаяСтрока.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	МассивСтрок = ЭтотОбъект.Список.НайтиСтроки(Новый Структура("Пометка", Истина));
	МассивРегистров = Новый Массив();
	Для Каждого Строка Из МассивСтрок Цикл
		МассивРегистров.Добавить(Новый Структура("ТипОМ, Имя, Синоним, Картинка", Строка.ТипОМ, Строка.Имя, Строка.Синоним, Строка.Картинка));
	КонецЦикла;
	
	ЭтотОбъект.Закрыть(МассивРегистров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Строка Из ЭтотОбъект.Список Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)

	Для Каждого Строка Из ЭтотОбъект.Список Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры
